Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/public_order_offenses_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: The law on public order offences is mainly set down in the Criminal Justice (Public Order) Act, 1994
ga: Tá an dlí maidir le cionta oird phoiblí leagtha amach go príomha sa Acht um Cheartas Coiriúil (Ord Poiblí) 1994

source: This legislation deals with the behaviour of people in public places and provides for various controls to be exercised at public events
ga: Baineann an reachtaíocht seo le hiompraíocht daoine in áiteanna poiblí agus forálann sé le haghaidh roinnt rialuithe éagsúla a bhíonn le feidhmiú ag ócáidí poiblí

source: The main purpose of the Act was as follows:
ga: Tá príomhaidhm an Achta mar a leanas:

source: • To update the law in relation to public order offences
ga: • An dlí a nuashonrú maidir le Cionta Oird Phoiblí;

source: • To create specific offences with regard to racketeering and demanding money with menaces;
ga: • Sainchionta a chruthú maidir le cambheartaíocht agus airgead a éileamh go bagrach;

source: • To deal with crowd control at public events; and
ga: • Déileáil le rialú slua ag ócáidí poiblí; agus

source: • To deal with miscellaneous (various) matters including a new offence prohibiting the advertising of brothels and prostitution
ga: • Déileáil le roinnt rudaí éagsúla lena n-áirítear cion nua, lena n-áirítear, cosc a chur le drúthlanna agus striapachas a fhógairt

source: For the purposes of the law, a ‘public place’ includes roads, public parks or recreational areas, cemeteries, churchyards, trains, buses and other public transport vehicles
ga: Chun críocha an dlí, cuimsíonn ‘áit phoiblí’ bóithre, páirceanna poiblí nó láithreacha chaithimh aimsire, reiligí, cealla, traenacha, busanna agus feithiclí iompair phoiblí eile

source: In the case of most of the offences under this Act, if a Garda suspects you of being involved, you are obliged to give your name and address if asked
ga: I gcás an chuid is mó de na cionta faoin Acht seo, má tá amhras ar Gharda go bhfuil tú páirteach, tá oibleagáid ort d’ainm agus do sheoladh a thabhairt má iarrtar ort iad a thabhairt

source: In fact, it is an offence if you fail to do so
ga: Is cion gan iad a thabhairt má iarrtar ort

source: You may be arrested without warrant if you fail to give your name and address
ga: Is féidir tú a ghabháil gan bharántas mura dtugann tú d’ainm agus do sheoladh

source: You are liable on summary conviction to a class D fine for that offence
ga: Má chiontaítear go hachomair thú is féidir rang D fíneáil a ghearradh ort as an gcion sin

source: The Criminal Justice (Public Order) Act 2003 provides that, if you are convicted of certain offences under the 1994 Act, you may be excluded from a premises for up to a year
ga: Forálann an Acht um Cheartas Coiriúil (Ord Poiblí) 2003 gur féidir tú a eisiamh ó áitreabh go ceann suas le bliain má chiontaítear thú as cionta áirithe faoi Acht 1994

source: This is in addition to the penalty under the 1994 Act
ga: Tá sé seo de bhreis ar an bpionós faoi Acht 1994

source: Intoxication (being drunk) in a public place
ga: A bheith ar meisce in áit phoiblí

source: Section 4 of the Criminal Justice (Public Order) Act 1994 deals with the offence of being intoxicated (that is, drunk) in a public place
ga: Baineann Alt 4 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 leis an gcion as a bheith ar meisce in áit phoiblí. Glacann an fhoráil seo áit Alt 9 den Dublin Police, Act, 1836

source: While the maximum fine for being intoxicated in a public place is a class E fine, the section gives the Gardai the power to seize the intoxicating substance (normally, the alcohol) where they suspect that an offence of being intoxicated in a public place is being committed
ga: Cé gur rang E fíneáil a ghearradh as a bheith ar meisce in áit phoiblí, tugann an t-alt an chumhacht do na Gardaí an tsubstaint mheisciúil (alcól de ghnáth) a ghabháil, nuair a bhíonn amhras orthu go bhfuil an cion as a bheith ar meisce in áit phoiblí á dhéanamh

source: Section 23B has been inserted in the Act by section 184 of the Criminal Justice Act 2006 and provides for a fixed charge fine instead of court proceedings for being intoxicated in a public place
ga: Tá Alt 23B curtha isteach san Acht ag Alt 184 den Acht um Cheartas Coiriúil 2006 a fhorálann le haghaidh fíneáil mhuirir sheasta in áit imeachtaí cúirte as a bheith ar meisce in áit phoiblí

source: This fixed charge fine, currently €100, may be set and varied by the Minister for Justice and Equality
ga: Is féidir leis an Aire Dlí agus Cirt agus Comhionannais an fhíneáil mhuirir sheasta seo, €100 faoi láthair, a shocrú agus a athrú

source: Disorderly conduct in a public place
ga: Iompar mí-ordúil in áit phoiblí

source: This offence is concerned with what is described as “offensive conduct”
ga: Baineann an cion seo le rudaí ar a dtugtar “iompar colúil”

source: Section 5(i) of the Criminal Justice (Public Order) Act 1994 makes it an offence for anyone in a public place to engage in offensive conduct:
ga: De réir Alt 5(i) den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 is cion é má bhíonn duine ar bith páirteach in iompar colúil in áit phoiblí:

source: • Between the hours of 12 o’clock midnight and 7 o’clock in the morning next following; or
ga: • Idir uaireanta 12 a chlog, meán oíche agus 7 a chlog ar maidin an lá dar gcionn;

source: • At any time, after having been requested by a member of An Garda Siochana to desist
ga: • Aon tráth eile, tar éis do chomhalta den Gharda Síochán a iarraidh ar dhuine an t-iompar sin a stopadh

source: Offensive conduct is unreasonable behaviour which (having regard to the circumstances), is likely to cause serious offence or serious annoyance to other people
ga: Is é is iompar colúil ann ná iompraíocht mhí-réasúnta a d’fhéadfadh (sna himthosca sin) col mór nó crá mór a chur ar dhaoine eile

source: The penalty for this offence is a class D fine
ga: Is é an pionós as an gcion seo ná rang D fíneáil

source: The purpose of this offence was to deal with the types of disorderly behaviour which falls short of threatening behaviour but could nevertheless adversely affect the quality of people’s lives
ga: Ba é cuspóir an chiona seo ná déileáil le cineálacha iompraíochta mí-iompracha nach bhfuil chomh holc le hiompraíocht bhagrach ach a dtiocfadh leo san am céanna drochéifeacht a bheith acu ar cháilíocht bheatha daoine eile

source: A typical example of this offence would be people shouting late at night having left nightclubs where this would cause serious annoyance to local residents
ga: Is é sampla tipiciúil ná daoine ag scairteadh go mall san oíche tar éis dóibh clubanna oíche a fhágáil in áit a mbeadh sé sin ina chrá croí ag áitritheoirí na háite

source: Section 23A has been inserted in the Act by Section 184 of the Criminal Justice Act 2006 and allows the Gardai to impose a fixed charge fine for disorderly conduct in a public place instead of court proceedings for this offence
ga: Tá Alt 23A curtha isteach san Acht ag Alt 184 den Acht um Cheartas Coiriúil 2006 a ligeann do na Gardaí fíneáil mhuirir sheasta a ghearradh as iompar mí-iomprach in áit phoiblí in áit imeachtaí cúirte as an gcion seo

source: In order to have the offence treated as a fixed charge offence, you must give your name and address to the Garda
ga: Más maith leat go láimhseálfaí an cion mar chion muirir sheasta, ní mór duit d’ainm agus do sheoladh a thabhairt do na Gardaí

source: Failure to do so means you may arrested without warrant and be convicted of a summary offence for which the maximum penalty is a class C fine
ga: Mura ndéanann tú seo is féidir tú a ghabháil gan bharántas agus is féidir tú a chiontú as cion achomair ar rang C fíneáil a bhaineann leis

source: If the Gardai choose to have this offence treated as a fixed-charge offence, they may serve notice on you that you will not be charged if a stated amount is paid within 28 days
ga: Má roghnaíonn na Gardaí go láimhseálfaí an cion seo mar chion muirir sheasta, is féidir leo fógra a sheirbheáil ort nach gcúiseofar thú má íoctar méid sonraithe taobh istigh de 28 lá

source: The amount of the fixed charge, currently €140, is set by Regulations
ga: Tá méid an mhuirir sheasta seo, €140 faoi láthair, socraithe ag Rialacháin

source: Threatening, abusive or insulting behaviour in a public place
ga: Iompraíocht bhagrach, mhaslach nó tharcaisneach in áit phoiblí

source: Section 6 of the Criminal Justice (Public Order) Act 1994 makes it an offence for any person in a public place to use threatening, abusive or insulting words or behaviour with the intention of causing a breach of the peace
ga: Is cion é má úsáideann duine ar bith focail bhagracha, mhaslacha nó tharcaisneacha nó má úsádeann siad iompraíocht bhagrach, mhaslach nó tharcaisneach in áit phoiblí agus é ar intinn acu briseadh síochána a dhéanamh de réir Alt 6 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994

source: A typical example of this would be where a person, by their words or actions, was likely to cause a fight with the person or persons they were insulting
ga: Is sampla tipiciúil de seo an cás ina bhfuil duine amháin ag maslú duine eile agus ba dhócha go dtosóidís troid le duine nó le daoine eile de dheasca a bhfocal nó a ngníomhartha

source: It would also cover the situation where groups of youths were looking for trouble by their threatening behaviour towards other people. Again, the Garda may confiscate alcohol
ga: Chlúdódh sé an cás chomh maith ina mbeadh grúpaí ógánach ar lorg trioblóide trína n-iompraíocht bhagrach i leith daoine eile.Arís eile, is féidir leis na Gardaí alcól a bhaint uathu

source: Any person found guilty of this offence can be liable to class D fine and to a prison sentence of 3 months maximum
ga: Is féidir rang D fíneáil agus téarma príosúnachta suas le huasmhéid de 3 mhí a ghearradh ar aon duine a fhaightear ciontach sa chion seo

source: Begging in an intimidating or threatening manner
ga: Ag lorg déirce ar bhealach is cúis le himeagla nó le bagairt

source: Under Section 2 of the Criminal Justice (Public Order) Act 2011 a person who begs in an aggressive, intimidating or aggressive manner is guilty of an offence
ga: Faoi Alt 2 den Acht um Cheartas Coiriúil (Ord Poiblí), 2011 beidh duine a bhíonn ag lorg déirce ar bhealach a chruthaíonn ionsaí, imeagla nó bagairt ciontach i gcion

source: A person found guilty of such an offence is liable on summary conviction to a class E fine and/or up to one month in prison
ga: Beidh duine a fhaightear ciontach sa chion sin faoi dhliteanas ar ciontú achomair chun fíneáil aicme E a íoc agus/nó a mhéid agus mí amháin a chaitheamh sa phríosún

source: The Act provides that where someone is begging near certain places such as an ATM, a night safe, a vending machine or a shop entrance the Gardaí have the powers to direct them to leave the area
ga: Foráiltear san Acht go bhfuil ag an nGarda Síochána an chumhacht chun duine atá ag lorg déirce i ngar d’áiteanna áirithe, ar nós UMB, taisceadán oíche, meaisín díola nó bealach iontrála siopa a ordú chun an limistéar a fhágáil

source: Failure to do as directed by a Garda is an offence with a class E fine on summary conviction
ga: Cion í gan a ordaíonn an Garda a dhéanamh ag a mbeidh fíneáil aicme E le híoc ar ciontú achomair

source: The Act also makes it an offence to organise or direct begging by another person
ga: Déantar cion, freisin, san Acht, lorg déirce ag duine eile a eagrú nó a stiúradh

source: On summary conviction you are liable to a class A fine and/or up to 12 months in prison
ga: Beidh tú faoi dhliteanas fíneáil aicme A a íoc ar ciontú achomair agus/nó a mhéid agus 12 mhí a chaitheamh sa phríosún

source: Distribution or display in a public place of material which is threatening, abusive, insulting or obscene
ga: Dáileadh nó taispeáint ábhar in áit phoiblí atá bagrach, maslach, tarcaisneach nó graosta

source: While Section 6 of the Criminal Justice (Public Order) Act 1994 deals with words or behaviour, Section 7 of the 1994 Act deals with distribution or display of offensive material
ga: Déileálann Alt 6 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 le focail nó iompraíocht, ach déileálann Alt 7 d’Acht 1994 le dáileadh nó taispeáint ábhair ghránna

source: The penalty for this offence is a class D fine and or a prison sentence of 3 months maximum
ga: Is é an pionós as an gcion seo ná rang D fíneáil agus/nó pianbhreith d’uasmhéid 3 mhí

source: The main difficulty which arises in section 7 is the fact that while something may be obscene to one person it might be thought to be quite normal by another person
ga: An phríomhdheacracht a bhaineann le hAlt 7 ná gur féidir le rud a bheadh gránna ag duine amháin ach mheasfadh duine eile gur gnáthrud atá ann

source: The European Court of Human Rights has dealt with the issue of sensitivity in the case of Muller v
ga: Dhéileáil Cúirt na hEorpa um Chearta an Duine le ceist na híogaireachta i gcás Muller v

source: Switzerland (1991) 13 E.H.R.R
ga: an Eilvéis (1991) 13 E.H.R.R

source: That case considered a conviction in Switzerland against Mr Muller for displaying obscene paintings
ga: Rinne an cás sin breathnú ar chiontú san Eilvéis in éadan an Uasail Muller as péintéireachtaí graosta a thaispeáint

source: The paintings depicted, in a crude manner, sexual relations between men and animals
ga: Léirigh na péintéireachtaí, ar dhóigh gháirsiúil, caidreamh collaí idir fir agus ainmhithe

source: The court held that the paintings were liable or likely to grossly offend the sense of sexual propriety of persons of ordinary sensitivity
ga: Ba é cinneadh na cúirte gur dhócha go gcuirfeadh na péintéireachtaí col mór ar dhaoine a bhfuil gnáthíogaireacht acu

source: It can therefore be said that the courts will apply the “ordinary man” test when deciding if the distribution or display of material is obscene or not
ga: Is féidir a rá mar sin go gcuirfidh na cúirteanna teist an “ghnáthfhir” i bhfeidhm nuair a chinneann siad an ábhar graosta atá á dháileadh nó á thaispeáint nó nach ea

source: Failure to comply with the direction of a member of An Garda Siochana
ga: Mainneachtain ordachán arna thabhairt ag comhalta den Gharda Síochána a chomhlíonadh

source: Section 8 of the Criminal Justice (Public Order) Act 1994 was designed to create an offence of failure to comply with a direction from a member of the Gardai to desist (or stop) from such conduct in circumstances where the Garda concerned has a reasonable apprehension (or fear) for the safety of persons or property or for the maintenance of the public peace
ga: Dearadh Alt 8 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 le cion a dhéanamh de nuair nach gcomhlíontar le hordachán ó chomhalta de na Gardaí maidir le scor d’iompraíocht den chineál sin (nó stop a chur léi) má bhíonn imní (nó eagla) réasúnta ar an nGarda maidir le sábháilteacht daoine nó maoine nó maidir leis an tsíocháin poiblí a choinneáil

source: The section represents a sensible approach where people are acting contrary to section 4, 5 or 6 (above) and the Gardai are of the view that to simply nip in the bud the potential trouble they can direct such people simply “move on” without having to apply the full force of the criminal law through arresting, charging and bringing before the courts such people
ga: Is cur chuige ciallmhar é an t-alt nuair a bhíonn daoine ag feidhmiú in éadan 4, 5 nó 6 (thuas) agus nuair a bhíonn na Gardaí den bharúil gur féidir leo ordú do dhaoine mar seo imeacht láithreach ó chomharsanacht na háite agus an trioblóid fhéideartha a stopadh ag an tús mar sin gan a bheith d’iallach orthu fórsa iomlán an dlí choiriúil a chur i bhfeidhm trí dhaoine mar sin a ghabháil, a chúiseamh agus a thabhairt os comhair na gcúirteanna

source: It shall be an offence to fail to comply, without reasonable excuse or lawful authority, with a direction given by a Garda under this section
ga: Beidh sé ina chion nuair nach gcomhlíontar le hordachán a thugann Garda, gan leithscéal réasúnta nó údarás dleathach, faoin alt seo

source: Any person convicted of this offence is liable on summary conviction to a class D fine or to a maximum term of 6 months in prison or both
ga: Aon duine a chiontaítear sa chion seo, dlífear orthu rang D fíneáil nó téarma suas le 6 mhí i bpríosún nó an dá rud, a chur air

source: Under Section 9 of the Criminal Justice (Public Order) Act 1994 anyone without legal authority or reasonable excuse, wilfully prevents or interrupts the free passage of any person or vehicle in any public place shall be guilty of an offence
ga: Faoi Alt 9 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 aon duine a choscann nó a chuireann isteach go toiliúil ar shaorbhealach aon duine nó feithicle in aon áit phoiblí, beidh sé ciontach i gcion

source: The penalty for this offence is a class E fine
ga: Is é an pionós as an gcion seo ná rang E fíneáil

source: This section was created in order to protect the constitutional rights of the individual to pass and re-pass on a public highway
ga: Cruthaíodh an t-alt seo d’fhonn cearta bunreachtúla an duine sárú agus athshárú ar an mhórbhealach phoiblí a chosaint

source: While the Gardai have no power of arrest under this Section they can invoke the powers of Section 8 of the Act and direct any person to desist from the obstruction in question
ga: Cé nach bhfuil aon chumacht gabhála ag na Gardaí faoin alt seo is féidir leo leas a bhaint as cumhachtaí Alt 8 agus ordú a thabhairt d’aon duine scor den toirmeasc atá i gceist

source: Failure to comply with that direction is an offence
ga: Is cion é gan an t-ordú sin a chomhlíonadh

source: Entering a building, etc, with intent to commit an offence
ga: Dul isteach i bhfoirgneamh srl. le hintinn cion a dhéanamh

source: Section 11 of the 1994 Act makes it an offence for anyone to enter (i.e., trespass) a building or the vicinity of a building with the intention of committing an offence and/or interfering with property
ga: De réir Alt 11 d’Acht 1994 is cion é d’aon duine dul isteach (i. Foghail a dhéanamh) i bhfoirgneamh nó i gcomharsanacht foirgnimh agus le hintinn cion a dhéanamh agus/nó le hintinn cur isteach ar aon mhaoin

source: For example, you need not have entered a building to commit an offence under this section
ga: Mar shampla, ní gá go ndeachaigh tú isteach i bhfoirgneamh le cion a dhéanamh faoin alt seo

source: By being on the property (i.e
ga: Is leor a bheith ar an réadmhaoin (i

source: in the back garden or the driveway of a house) this will be enough to bring a person within the definition of this section
ga: sa ghairdín cúil nó ar chabhsa an tí) le duine a thabhairt faoi shainmhíniú an ailt seo

source: It will be a matter for the prosecution in any proceedings to prove that the accused person was present in the building or on the property with the intention of committing an offence or with intent to interfere with any property
ga: Beidh sé faoin chúiseamh in aon imeachtaí a chruthú go raibh an duine cúisithe i láthair san fhoirgneamh nó ar an réadmhaoin agus é d’intinn acu cion a dhéanamh nó d’intinn acu cur isteach ar aon réadmhaoin

source: Those found guilty of this offence will be liable on summary conviction to a class C fine or to a maximum term in prison of 6 months or to both
ga: Aon duine a bheidh ciontach sa chion seo, dlífear rang C fíneáil nó uastéarma i bpríosún de 6 mhí nó an dá rud, a chur air

source: It is an offence to trespass in a manner likely to cause fear in another person under Section 13 of the Act
ga: Is cion é foghail a dhéanamh ar mhodh a chuireann eagla, nó ar dhóigh dó eagla a chur, ar dhuine eile faoi Alt 13 den Acht

source: There is no inclusion of any intent to commit a crime or to interfere with property in this section
ga: Ní chuimsítear aon intinn cion a dhéanamh ná cur isteach ar réadmhaoin san alt seo

source: This can be seen from the powers given to the Gardai under this Section
ga: Is féidir é seo a fheiceáil ó na cumhachtaí a thugtar do na Gardaí faoin Alt seo

source: A Garda may direct any person he or she finds trespassing on a building or the cartilage, in such a manner as causes or is likely to cause fear in another, to desist from acting in such a manner and to leave immediately the vicinity or area of the place concerned in a peaceable and orderly manner
ga: Is féidir le Garda ordú a thabhairt d'aon duine a fhaigheann sé ag déanamh foghla ar fhoirgneamh nó ar a chúirtealáiste, ar mhodh a chuireann eagla nó ar dhóigh dó eagla a chur, ar dhuine eile, scor de bheith ag gníomhú ar an modh sin agus imeacht láithreach as comharsanacht na háite lena mbaineann ar mhodh sítheach ordúil

source: However, if the person fails or refuses, without reasonable excuse or lawful authority, to comply with the direction of the Garda he or she is guilty of an offence and is liable to a class D fine or sent to prison for a maximum of 6 months or to both
ga: Ach is cion é ag an duine, gan údarás dleathach nó leithscéal réasúnach, mainneachtain ordachán an Gharda a chomhlíonadh, agus is féidir rang D fíneáil a ghearradh air nó é a chur chuig an bpríosún go ceann uastréimhse de 6 mhí nó an dá rud

source: The offence of riot is seen as one of the major and most serious of the public order offences
ga: Meastar go bhfuil an chíréib ar cheann de na cionta in aghaidh an oird phoiblí is mó agus is tromchúisí

source: Section 14 of the Criminal Justice (Public Order) Act 1994 defines riot as;
ga: Sainmhíníonn Alt 14 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 círéib mar seo;

source: • 12 or more persons who are present together as any place (public or private) use or threaten to use unlawful violence for a common purpose, and
ga: • go ndéanfaidh 12 dhuine nó níos mó, atá i láthair le chéile in aon áit (cibé acu is áit phoiblí nó áit phríobháideach an áit sin), foréigean neamhdhleathach a úsáid nó a bhagairt le haghaidh comhchuspóra, agus

source: • The conduct of these persons, taken together, is such as would cause a person of reasonable firmness present at that place to fear for his or another person’s safety
ga: • go mbeidh iompar na ndaoine sin, á ghlacadh ina iomláine, de chineál a bheadh ina chúis le heagla a chur ar dhuine réasúnta dionbháilte, a bheadh i láthair, san áit sin, maidir lena shábháilteacht féin nó le sábhailteacht duine eile,

source: then, each of the person’s using unlawful violence for the common purpose shall be guilty of the offence of riot”
ga: ansin, beidh gach duine de na daoine a úsáidfidh nó a bhragróidh foréigean neamhdhleathach ciontach sa chion ar mí-ord foréigneach é

source: The important parts of this offence are:-
ga: Is iad na heilimintí is tábhachtaí den chion seo ná:-

source: • That at least 12 people must use or threaten to use violence,
ga: • Go gcaithfidh ar a laghad 12 dhuine foréigean a úsáid nó a bhagairt,

source: • They must have a common purpose in doing so,
ga: • Go gcaithfidh siad comhchuspóir a bheith acu agus iad ag déanamh amhlaidh,

source: • That the conduct would cause a reasonable observer to fear for his or her safety or the safety of some other person, and
ga: • Go mbeadh an t-iompar ina chúis le heagla a chur ar bhreathnóir réasúnta maidir lena shábháilteacht féin nó le sábháilteacht duine eile,

source: • The accused did in fact use unlawful violence
ga: • Gur fíor gur úsáid an duine ciontaithe foréigean neamhdhleathach

source: This offence can be committed in a public or private place
ga: Tá an cion seo difriúil leis na cionta eile san Acht, as siocair gur féidir é a dhéanamh in áit phoiblí nó in áit phríobháideach, ní ionann agus na cionta go léir eile a dhéantar in áit phoiblí
